"""
Создать текстовый файл (не программно), построчно записать фамилии сотрудников
и величину их окладов (не менее 10 строк). Определить, кто из сотрудников
имеет оклад менее 20 тыс., вывести фамилии этих сотрудников.
Выполнить подсчет средней величины дохода сотрудников.
Пример файла:
Иванов 23543.12
Петров 13749.32

"""
data_lst = ["Иванов 23456.67\n",
            "Петров 19065.23\n",
            "Новожилов 48765.12\n",
            "Румянцева 14987.35\n",
            "Соловьёв 22076.43\n",
            "Семенов 20987.35\n",
            "Елисеев 24986.35\n",
            "Буланова 19387.34\n",
            "Сидоров 31967.35\n",
            "Светлова 29987.35\n",
            "Горохов 18987.35\n"]
with open("task3.txt", "w", encoding='utf-8') as file_obj:
    file_obj.writelines(data_lst)

with open("task3.txt", "r", encoding='utf-8') as file_obj:
    salary = []
    salary_min = []
    for i in file_obj:
        print(i, end="")
        t = i.split()
        if float(t[1]) < 20000:
            salary_min.append(t[0])
        salary.append(t[1])

print('Оклад меньше 20 000: ', end="")
print(*salary_min, sep=', ')
print(f'Cредний оклад {round(sum(map(float, salary)) / len(salary), 2)}')